tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/bubbleColumnPolydisperse/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    zone;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
           boxes
           (
                (0 0.4 0) (0.15 0.5 0.1)
           );
        }
    }

    {
        name    zone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
           set  zone;
        }
    }
);

// ************************************************************************* //
